backend/src/main/resources/templates/AuszahlungSapService/SST_009_BusinessPartnerCreate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:be.ch:KTBE_MDG:BUSINESS_PARTNER">
  <soapenv:Header/>
  <soapenv:Body>
    <urn:BusinessPartnerCreate_Request>
      <SENDER>
        <SYSID>{sysId}</SYSID>
        <!--Optional:-->
        <BETRIEB/>
        <DELIVERY_ID>{deliveryId}</DELIVERY_ID>
        <!--Optional:-->
        <VERSION>1.0</VERSION>
      </SENDER>
      <BUSINESS_PARTNER>
        <HEADER>
          <PARTN_CAT>1</PARTN_CAT>
          <!--Optional:-->
          <PARTN_TYP/>
          <!--Optional:-->
          <PARTN_GRP>ZBPE</PARTN_GRP>
          <!--Optional:-->
          <PARTN_TAXKD/>
        </HEADER>
        <ID_KEYS>
          <!-- EXT_ID : length 6 -->
          <EXT_ID>{extId}</EXT_ID>
          <AHV_NR/>
          <!--Optional:-->
          <UID_NR/>
          <!--Optional:-->
          <ZPV_NR/>
        </ID_KEYS>
        <PERS_DATA>
          <FIRSTNAME>{firstName}</FIRSTNAME>
          <LASTNAME>{lastName}</LASTNAME>
          <CORRESPONDLANGUAGEISO>DE</CORRESPONDLANGUAGEISO>
          <!--Optional:-->
          <BIRTHNAME/>
          <!--Optional:-->
          <MIDDLENAME/>
          <!--Optional:-->
          <SECONDNAME/>
          <!--Optional:-->
          <TITLE_ACA2/>
          <!--Optional:-->
          <TITLE_SPPL/>
          <!--Optional:-->
          <PREFIX1/>
          <!--Optional:-->
          <PREFIX2/>
          <!--Optional:-->
          <NICKNAME/>
          <!--Optional:-->
          <INITIALS/>
          <!--Optional:-->
          <NAMEFORMAT/>
          <!--Optional:-->
          <NAMCOUNTRY/>
          <!--Optional:-->
          <NAMCOUNTRYISO/>
          <!--Optional:-->
          <BIRTHPLACE/>
          <!--Optional:-->
          <MARITALSTATUS/>
          <!--Optional:-->
          <CORRESPONDLANGUAGE/>
          <!--Optional:-->
          <FULLNAME/>
          <!--Optional:-->
          <EMPLOYER/>
          <!--Optional:-->
          <OCCUPATION/>
          <!--Optional:-->
          <NATIONALITY/>
          <!--Optional:-->
          <NATIONALITYISO/>
          <!--Optional:-->
          <COUNTRYORIGIN/>
          <!--Optional:-->
          <BIRTHDT_STATUS/>
        </PERS_DATA>
        <!--1 or more repetitions:-->
        <ADDRESS>
          <ADR_KIND>XXDEFAULT</ADR_KIND>
          <!--Optional:-->
          <C_O_NAME/>
          <CITY>{ort}</CITY>
          <!--Optional:-->
          <DISTRICT/>
          <POSTL_COD1>{plz}</POSTL_COD1>
          <!--Optional:-->
          <PO_BOX/>
          <STREET>{strasse}</STREET>
          <HOUSE_NO>{hausNr}</HOUSE_NO>
          <COUNTRY>CH</COUNTRY>
        </ADDRESS>
        <!--Zero or more repetitions:-->
        <COMMUNICATION>
          <!--Optional:-->
          <EMAIL/>
          <!--Optional:-->
          <TELEPHONE/>
          <!--Optional:-->
          <MOBILE/>
          <!--Optional:-->
          <FAX/>
        </COMMUNICATION>
        <!--Zero or more repetitions:-->
        <PAYMENT_DETAIL>
          <IBAN>{iban}</IBAN>
          <!--Optional:-->
          <ACCOUNTHOLDER/>
        </PAYMENT_DETAIL>
      </BUSINESS_PARTNER>
    </urn:BusinessPartnerCreate_Request>
  </soapenv:Body>
</soapenv:Envelope>
